#pragma once
/*******************************************************************/
/*              П Р О Т О Т И П Ы    Ф У Н К Ц И Й                 */
/*******************************************************************/

// Better_Linear_search
int BLS(int* pznachenue           // указатель на первый элемент динамического вектора
	, int number                // длина динамического вектора
	, int search);              // ключ поиска, введённый пользователем

// Sentinel_Linear_ search
int SLS(int* pznachenue           // указатель на первый элемент динамического вектора
	, int number                // длина динамического вектора
	, int search);              // ключ поиска, введённый пользователем

// T-sequential search
int TS(int* pznachenue            // указатель на первый элемент динамического вектора
	, int number                 // длина динамического вектора
	, int search);               // ключ поиска, введённый пользователем

// Binary Search 
int BS(int* pznachenue            // указатель на первый элемент динамического вектора
	, int number                 // длина динамического вектора
	, int search);               // ключ поиска, введённый пользователем

// подробный Better_Linear_search 
int BLS_search(int* pznachenue    // указатель на первый элемент динамического вектора
	, int number         // длина динамического вектора
	, int search);       // ключ поиска, введённый пользователем

// подробный Sentinel_Linear_ search
int SLS_search(int* pznachenue    // указатель на первый элемент динамического вектора
	, int number         // длина динамического вектора
	, int search);       // ключ поиска, введённый пользователем

// подробный T-sequential search
int TS_search(int* pznachenue     // указатель на первый элемент динамического вектора
	, int number          // длина динамического вектора
	, int search);        // ключ поиска, введённый пользователем

// подробный Binary Search
int BS_search(int* pznachenue     // указатель на первый элемент динамического вектора
	, int number          // длина динамического вектора
	, int search);        // ключ поиска, введённый пользователем

