#pragma once
/*******************************************************************/
/*                    Н А Б О Р    Ф А Й Л О В                     */
/*******************************************************************/
extern const char* FNAME;               // путь к файлу через константный указатель

/*******************************************************************/
/*            Г Л О Б А Л Ь Н Ы Е   К О Н С Т А Н Т Ы              */
/*******************************************************************/
extern const int big;                    // максимальное отклонение для генерации чисел, больших ключа в массиве
extern const int kol_vo_min;             // минимальный отступ для добавления как минимум двух меньших, чем ключ элемента;
                                         // самого ключа; одного большего, чем ключ элемента