/*******************************************************************************
 * Л А Б О Р А Т О Р Н А Я   Р А Б О Т А  №2  З А   3   С Е М Е С Т Р   С  +  +*
 *-----------------------------------------------------------------------------*
 * Project Type  : Win64 Console Application                                   *
 * Project Name  : Search algorithms                                           *
 * File Name     : Алгоритмы поиска. CPP                                       *
 * Programmer(s) : Викулов Д.Г.                                                *
 * Modifyed By   :                                                             *
 * Created       : 16/10/22                                                    *
 * Last Revision : 20/10/22                                                    *
 * Comment(s)    : реализация алгоритмов поиска BLS, SLS, T-последовательного  *
 *                 поиска в упорядоченном массиве, B - бинарного поиска        *
 *******************************************************************************/

#include <iostream>     // стандартные потоки ввода/вывода
#include "Functions.h"


/**************************************************************/
/*            О С Н О В Н А Я   П Р О Г Р А М М А             */
/**************************************************************/
int main()
{
	system("color F0");                      // делаем консоль светлой
	setlocale(LC_ALL, "Rus");                // подключаем русский язык
	system("cls");                           // чистим консоль перед выводом

	int number = 0;                          // количество элементов массива
	int search = 0;                          // элемент для поиска в динамическом массиве
	int* pznachenue = NULL;                  // указатель на динамический массив целых чисел
	pechat_mass_search(pznachenue, number, search); // вызов основной функции, где будут вызываться другие
	return 0;                                // возвращаем обещанное значение
} //main()

 